import React, { useState, useEffect } from 'react';
import classes from "./Main.module.css";
import Converter from "../Converter/Converter.jsx";

function Main() {
    return (
        <div className="main__container">
            <div className={classes.wrapper}>
                <div className={classes.about}>
                    <span>Converter</span> — це проста веб-сторінка, яка дозволяє користувачам швидко й легко конвертувати валюту. Завдяки зручному інтерфейсу Converter дозволяє користувачам вибрати бажану валюту та ввести суму, яку потрібно конвертувати. Потім веб-сайт автоматично розраховує курс конвертації в режимі реального часу, відображаючи конвертовану суму на екрані. Однією з ключових особливостей Converter є його простота. Користувачам не потрібно створювати обліковий запис або надавати будь-яку особисту інформацію, щоб користуватися веб-сайтом. Це робить його швидким і безпроблемним способом конвертації валюти в дорозі, чи то для подорожі, бізнесу чи особистого використання. Конвертер підтримує широкий спектр валютних пар, включаючи основні світові валюти, такі як долар США, євро, британський фунт і японська ієна. Це робить його корисним інструментом для всіх, хто потребує конвертації валюти, незалежно від місця розташування чи галузі. Загалом Converter є цінним ресурсом для тих, кому потрібно швидко й легко конвертувати валюту без клопоту зі складними інтерфейсами чи непотрібними функціями. Його простота та легкість використання роблять його незамінним інструментом для тих, хто потребує конвертації валюти, незалежно від того, де вони знаходяться у світі.
                </div>
                <Converter />
            </div>
        </div>
    )
}

export default Main;